#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "RUS");


    cout << "Дисциплина:\tОсновы алгоритмизации и программирования\n"
        << "Группа:\t\tИС50-2-22\n"
        << "Студент:\tСвиридова Е.К.\n"
        << "Пр. работа:\t№6 Обработка двумерных массивов\n"
        << "Вариант:\t№17\n"
        << "--------------------------------------------------------\n\n";
    
    const int M = 5;
    const int N = 6;
    
    
    double a[M][N] = { {5, 4.2, 9, 7.1, 0, 1} , {-2, 0.2, 5.7, -8, 50, -65} , {0, 2.3, 0, 2, 9, 0} , {0, 14, 1.5, 5.3, -0.3, 0} , {12, 4.3, 42, 19, 0, 0 } };
    cout << "Матрица А: " << "\n";

  for (int k = 0; k < M; k++)
  {
      for (int d = 0; d < N; d++)
      {
          cout.width(7);
          cout << a[k][d] << ((d < N - 1) ? "," : "");
      }
      cout << endl;
  }
  cout << endl;


  double B[N] = {0};

  for (int d = 0; d < N; d++) {
      int k = 0;

      for (int n = 0; n < M; n++) {
          if (a[n][d] == 0) {
              k++;
          }
      }
      B[d] = k*100.0 / M;
  }

  cout << "Вектора В, где B[I] - это процент нулевых элементов в I-том столбце матрицы:\n ";
  for (int d = 0; d < N; d++) {
      cout << "B[" << d << "]=" << B[d] << "% \n";
  }
  cout << endl;

  system("pause");
  return 0;
}

